In [1]:
#%matplotlib widget
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from ipywidgets import widgets, interact, interactive, fixed, interact_manual

def ck(m1, m2, t1, t2, tf):
    Cp = 4.184
    dT = lambda t, tf: tf - t
    return(-(m1 * Cp * dT(t1, tf) + m2 * Cp * dT(t2, tf))/dT(t1, tf))

def dH(m_h2o, m_naoh, Ck, t1, tf):
    Mr = 39.997
    Cp = 4.184
    dT = tf - t1
    m = m_h2o + m_naoh
    return -(m * Cp * dT + Ck * dT) * Mr / m_naoh / 1000

dH_rxn = []

In [2]:
# CONSTANZA ACETO
datos = pd.read_excel('TP_Termo_Aceto Constanza.xlsx')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
display(Ck)

deltaH = dH(datos['mHcl'], datos['mNaOH'], (Ck[1]+ Ck[2])/2, datos['T1'], datos['Tf'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
dH_rxn.append(deltaH.iloc[-2])
print(dH_rxn)

,Exp,m1,m2,mNaOH,mHcl,T1,T2,Tf,Resultados,Unnamed: 9
0,Ck1,45.133,56.111,NaN,NaN,46.3,23.5,36.5,122.591,NaN
1,Ck2,49.810,36.031,NaN,NaN,45.1,23.3,37.5,73.266,NaN
2,Ck3,46.344,45.883,NaN,NaN,45.8,23.5,36.2,60.046,NaN
3,NaOH 1,NaN,NaN,0.999,97.92,25.2,NaN,30.0,-96.060,con Ck = 90 J/K
4,NaOH 2,NaN,NaN,1.019,102.09,24.5,NaN,29.8,-107.580,con Ck = 90 J/K

0    122.591029
1     73.266354
2     60.062933
3           NaN
4           NaN
dtype: float64

0           NaN
1           NaN
2           NaN
3    -92.349444
4   -103.614812
dtype: float64

[-103.61481150872012, -92.34944361688461]

In [3]:
# TOMÁS DE ARTECHE
datos = pd.read_excel('tp_termo_dearteche.xlsx')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
display(Ck)

deltaH = dH(datos['m2'], datos['m1'], (Ck[0] + Ck[1])/2, datos['T1'], datos['T2'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

      Exp    T1    T2    Tf     m1     m2  RESULTADO
0     Ck1  45.5  23.8  35.0  48.02  49.00      17.77
1     Ck2  45.7  24.0  35.2  48.61  49.30      29.17
2     NaN   NaN   NaN   NaN    NaN    NaN        NaN
3     NaN   NaN   NaN   NaN    NaN    NaN        NaN
4  deltaH  24.3  29.4   NaN   1.00  99.95   88936.00
5  deltaH  24.3  29.4   NaN   1.00  99.95   91261.00

0    17.768053
1    16.638373
2          NaN
3          NaN
4          NaN
5          NaN
dtype: float64

0     7.647929
1     7.621591
2          NaN
3          NaN
4   -89.667189
5   -89.667189
dtype: float64

[-103.61481150872012, -92.34944361688461, -89.66718917639596]

In [4]:
# PABLO AVEDAÑO
datos = pd.read_csv('tp_termo_avedanio.csv')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
display(Ck)

deltaH = dH(datos['mHCl'], datos['mNaOH'], Ck[0], datos['T1'], datos['Tf'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

      Exp     T1    T2    Tf      m1      m2  mNaOH     mHCl  resultado
0     ck1  42.50  23.4  35.8  51.146  51.000    NaN      NaN     180.90
1     ck2  36.20  23.4  24.5  51.011  50.301    NaN      NaN     194.21
2  deltaH  24.35   NaN  29.5     NaN     NaN  1.025  102.411        NaN

0    180.924778
1   -193.643244
2           NaN
dtype: float64

0           NaN
1           NaN
2   -123.329683
dtype: float64

[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488]

In [5]:
# VICENTE DELL'ORO SANSONI
datos = pd.read_excel('TP_vicente.xlsx')
display(datos)
print(datos.keys())

Ck = ck(datos['masa 1 '], datos['masa 2'], datos['T1'], datos['T2'], datos['TF'])
display(Ck)

deltaH = dH(datos['masa 1 '], datos['masa 2'], (Ck[1] + Ck[1])/2, datos['T2'], datos['TF'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
dH_rxn.append(deltaH.iloc[-2])
print(dH_rxn)

    Exp  masa 1   masa 2    T1    T2    TF  resultados
0  ck_1   49.496  47.908  47.8  22.4  36.7      52.910
1  ck_2   48.796  48.243  47.5  23.4  37.2      53.760
2  dH_1   99.393   1.054   NaN  24.8  29.7     -91.962
3  dH_2   99.009   1.000   NaN  24.8  29.8     -93.517

Index(['Exp', 'masa 1 ', 'masa 2', 'T1', 'T2', 'TF', 'resultados'], dtype='object')

0    51.142351
1    66.275616
2          NaN
3          NaN
dtype: float64

0    -5.656701
1    -5.403535
2   -90.470434
3   -96.935384
dtype: float64

[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382]

In [6]:
# GABIEL GONZÁLEZ
datos = pd.read_csv('DatosTermo_Gonzalez - Hoja 1.csv')
display(datos)
print(datos.keys())

Ck = ck(datos['m1 (g)'], datos['m2 (g)'], datos['T1(s)'], datos['T2(s)'], datos['TF(s)'])
display(Ck)

#deltaH = dH(datos['masa 1 '], datos['masa 2'], (Ck[1] + Ck[1])/2, datos['T2'], datos['TF'])
#display(deltaH)

   Exp  T1(s)  T2(s)  TF(s)  Resultado (J)  m1 (g)  m2 (g)
0  CK1   47.2     25   35.0           16.7   51.83    48.0
1  CK2   44.4     25   34.5           35.0   48.00    45.8

Index(['Exp', 'T1(s)', 'T2(s)', 'TF(s)', 'Resultado (J)', 'm1 (g)', 'm2 (g)'], dtype='object')

0   -52.240327
1   -16.947313
dtype: float64

In [7]:
# MATIAS NAHUEL GUERRERO
datos = pd.read_csv('tp_termo_guerrero.csv')
display(datos)
print(datos.keys())

Ck = ck(datos['masa 1'], datos['masa 2'], datos['T1'], datos['T2'], datos['Tf'])
display(Ck)

deltaH = dH(datos['masa 1'], datos['masa 2'], (Ck[0] + Ck[1])/2, datos['T1'], datos['Tf'])
#deltaH = dH(datos['masa 1'], datos['masa 2'], (65.63 + 72.72)/2, datos['T1'], datos['Tf'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

  Experiencia    T1    T2    Tf  Resultado  masa 1  masa 2
0         Ck1  45.0  22.4  35.5      65.73  49.599  46.657
1         Ck2  46.8  22.4  36.4      72.72  47.220  47.323
2     Delta H  24.0   NaN  30.3    -112.99  99.989   1.079

Index(['Experiencia', 'T1', 'T2', 'Tf', 'Resultado', 'masa 1', 'masa 2'], dtype='object')

0    61.666082
1    68.969217
2          NaN
dtype: float64

0      3.811790
1      4.051180
2   -114.007123
dtype: float64

[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671]

In [8]:
# TOMÁS LEUNDA
datos = pd.read_csv('LEUNDA_TP2.csv', index_col=0)
display(datos)


Ck = ck(datos['M1 (gr)'], datos['M2 (gr)'], datos['T1 (°C)'], datos['T2 (°C)'], datos['TF (°C)'])
print(Ck)

deltaH = dH(datos['M1 (gr)'], datos['M2 (gr)'], (Ck[2] + Ck[2])/2, datos['T1 (°C)'], datos['T2 (°C)'])
print('DH')
print(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

             T1 (°C)  T2 (°C)  TF (°C)  M1 (gr)  M2 (gr)  resultado
Experiencia
ck1             47.5     23.0     37.5    50.00    50.00       94.1
ck2             50.3     22.0     38.3    49.80    51.40       83.4
ck3             49.0     22.5     36.2    49.70    51.40       22.2
deltaH          23.5     29.0      5.5    99.52     0.94      -78.5

Experiencia
ck1        94.140000
ck2        83.756707
ck3        22.234038
deltaH   -421.526378
dtype: float64
DH
Experiencia
ck1         8.635779
ck2         9.814075
ck3         9.181230
deltaH   -103.569795
dtype: float64
[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671, -103.56979450193752]

In [9]:
# LUCÍA MESYNGIER

In [10]:
# AGUSTINA PEQUE
datos = pd.read_csv('tptermo_agus.csv', index_col=0)
#display(datos)
print(datos.keys())
datos.to_excel('datos_termo_para_lucia.xlsx')

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf '])
print(Ck)

#DeltaH = dH(datos['m1'], datos['m2'], (Ck[1] + Ck[0])/2, datos['T1'], datos['Tf '])
DeltaH = dH(datos['m1'], datos['m2'], (41.9 + 46.75)/2, datos['T1'], datos['Tf '])
print('\nDH')
print(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

Index(['T1', 'm1', 'T2', 'm2', 'Tf ', 'Resultado', 'Unidad'], dtype='object')
Exp
Ck1    42.808452
Ck2    53.541714
dH1          NaN
dH2          NaN
dtype: float64

DH
Experiencia
ck1         8.635779
ck2         9.814075
ck3         9.181230
deltaH   -103.569795
dtype: float64
[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671, -103.56979450193752, -103.56979450193752]

In [11]:
# CAROLINA NICOLE SCHLAEN

datos = pd.read_excel('Schlaen_Datos_TpTermo.xlsx')
display(datos)

Ck = ck(datos['m1'], datos['m2'], datos['T1'], datos['T2'], datos['Tf'])
print(Ck)

deltaH = dH(datos['msc'], datos['mNaOH'], (29.6+52.9)/2, datos['T1'], datos['Tf'])

print(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

,Unnamed: 0,T1,T2,Tf,m1,m2,msc,mNaOH,resultado,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,Ck 1,47.15,23.6,35.7,45.076,49.348,NaN,NaN,29.595,NaN,NaN,NaN,NaN
1,Ck 2,46.20,23.6,36.1,48.223,49.189,NaN,NaN,52.946,NaN,NaN,NaN,NaN
2,Delta H,22.90,NaN,27.8,NaN,NaN,99.509,1.011,-88709.000,NaN,NaN,NaN,NaN

0    29.595168
1    52.946324
2          NaN
dtype: float64
0          NaN
1          NaN
2   -89.526256
dtype: float64
[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671, -103.56979450193752, -103.56979450193752, -89.5262556305678]

In [12]:
# TOBÍAS VIOLA APREA
datos = pd.read_excel('tp_termo_Toby.xlsx')
display(datos)

Ck = ck(datos['m1 (g)'], datos['m2 (g)'], datos['T1 (C)'], datos['T2 (C)'], datos['Tf (C)'])
print(Ck)

deltaH = dH(datos['mHCl (g)'], datos['mNaOH (g)'], 20, datos['T1 (C)'], datos['Tf (C)'])
print(deltaH)

dH_rxn.append(deltaH.iloc[-1])
dH_rxn.append(deltaH.iloc[-2])
print(dH_rxn)

,Experiencia,T1 (C),T2 (C),Tf (C),m1 (g),m2 (g),mHCl (g),mNaOH (g),Resultado
0,Ck1,43.8,25.5,34.0,48.830,48.358,NaN,NaN,-28.786978
1,Ck2,43.5,25.5,34.9,48.872,49.092,NaN,NaN,20.008396
2,Ck3,44.3,22.7,34.0,49.729,49.712,NaN,NaN,20.103324
3,∆H1,24.0,NaN,28.6,NaN,NaN,100.136,1.0260,-78661.675077
4,∆H2,24.0,NaN,28.8,NaN,NaN,100.485,1.1625,-72684.702616

0   -28.814525
1    20.027543
2    20.122562
3          NaN
4          NaN
dtype: float64
0          NaN
1          NaN
2          NaN
3   -79.487384
4   -73.539674
dtype: float64
[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671, -103.56979450193752, -103.56979450193752, -89.5262556305678, -73.5396736849755, -79.48738368328422]

In [13]:
# JULIÁN VILLA
datos = pd.read_excel('tp_termo_julian_mod.xlsx')
display(datos)
print(datos.keys())

Ck = ck(datos['M1'], datos['M2'], datos['T1'], datos['T2'], datos['TF'])
display(Ck)

deltaH = dH(datos['M1'], datos['M2'], (Ck[0] + Ck[2])/2, datos['T1'], datos['TF'])
display(deltaH)

dH_rxn.append(deltaH.iloc[-1])
print(dH_rxn)

             EXP    T1    T2    TF      M1      M2     Ck
0              1  45.6  25.0  37.2  49.157  49.513   95.27
1              2  47.0  25.0  38.9  49.603  49.766  149.73
2              3  45.9  25.0  37.4  49.644  49.141   92.30
3  1 (Ck=95.270)  25.4   NaN  31.2  93.343   1.084     NaN

Index([' EXP', 'T1', 'T2', 'TF', 'M1', 'M2', 'Ck '], dtype='object')

0     95.205824
1    149.778470
2     92.232293
3           NaN
dtype: float64

0      3.437269
1      3.316698
2      3.507848
3   -104.606524
dtype: float64

[-103.61481150872012, -92.34944361688461, -89.66718917639596, -123.32968262290488, -96.93538373198565, -90.47043372888382, -114.0071232564671, -103.56979450193752, -103.56979450193752, -89.5262556305678, -73.5396736849755, -79.48738368328422, -104.60652417851574]

In [18]:
plt.figure(figsize=(6, 6))
dH_rxn = np.array(dH_rxn)

plt.plot(dH_rxn, 'o', label='Mediciones')
plt.ylabel(r'$\Delta$H de la reacción completa')
plt.xlabel('Número de determinación')

dHsol = -44.50
dHneut = -57.62

plt.plot([0,12], [dHsol + dHneut, dHsol+dHneut], '--', label='valor esperado')
plt.legend()
plt.show()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [17]:
%matplotlib widget

def dH(dT, Ck):
    m_h2o=100
    m_naoh=1
    Mr = 39.997
    Cp = 4.184
    m = m_h2o + m_naoh
    return -(m * Cp * dT + Ck * dT) * Mr / m_naoh / 1000
interact(dH, Ck=widgets.IntSlider(min=0, max=100, value = 20, step = 5, description="Ck"),
         dT= widgets.FloatSlider(min=4, max=7, value=5.2, step=0.2, description="DT"));

interactive(children=(FloatSlider(value=5.2, description='DT', max=7.0, min=4.0, step=0.2), IntSlider(value=20…